{
    "shared": {
        "months": {
            "january": "January",
            "february": "February",
            "march": "March",
            "april": "April",
            "may": "May",
            "june": "June",
            "july": "July",
            "august": "August",
            "september": "September",
            "october": "October",
            "november": "November",
            "december": "December"
        },
        "present": "Present",
        "season": {
            "spring": "Spring",
            "summer": "Summer",
            "autumn": "Autumn",
            "winter": "Winter"
        }
    },
    "header": {
        "nav": {
            "home": "Home",
            "education": "Education",
            "experience": "Experience",
            "publications": "Publications",
            "projects": "Projects",
            "skills": "Skills"
        }
    },
    "index": {
        "title": "A PhD student at Université Laval",
        "location": "Quebec, QC, Canada",
        "website": "Website",
        "aboutTitle": "About Me",
        "aboutText": "I am a PhD candidate in Computer Science at Université Laval\n                            (Canada) specializing in AI-driven software architecture and distributed systems.\n                            My research focuses on developing intelligent approaches for automated microservices\n                            decomposition, resulting in four peer-reviewed publications in leading journals and\n                            conferences including Empirical Software Engineering (EMSE) and Information and Software Technology (IST).\n                            Previously, I completed a Master's degree in Smart Systems from the National School of Computer Science (Tunisia),\n                            with a focus on deep learning applications. Fully bilingual in English and French,\n                            I combine theoretical expertise in machine learning with strong practical experience in\n                            cloud-native technologies (Kubernetes, Docker), distributed systems design, and\n                            Machine Learning frameworks (PyTorch, Transformers).",
        "researchTitle": "Research",
        "researchText": "While microservices architecture has proven effective for large-scale applications due to\n                            its modularity and cloud compatibility, migrating from an established monolithic system to\n                            a microservices architecture remains an expensive and challenging process.\n                            The critical decomposition step of partitioning the monolith's components into target\n                            microservices has been cited as the main obstacle.\n                            <br>\n\n                            My thesis focuses on studying automated decomposition and refactoring approaches for the\n                            purpose of modernizing the migration and modernization process of software architectures.\n                            I introduce AI-based approaches ranging from evolutionary algorithms to LLM-based representation\n                            learning to improve the efficiency of decomposition approaches and provide better microservices recommendations.\n                            In addition, this thesis introduces an approach to automatically refactor monolithic interactions\n                            into RPCs using a combination of Gen AI models and meta-modelling methods.",
        "researchInterestsTitle": "Research Interests:",
        "researchInterests": "Artificial Intelligence, Machine Learning, Deep Learning, Microservices, Code Refactoring, Cloud",
        "newsTitle": "News",
        "resumeTitle": "Resume",
        "resumePath": "/assets/pdfs/khaled_sellami_resume.pdf"
    },
    "education": {
        "pageTitle": "Education",
        "coreCourses": "Core Courses",
        "phd": {
            "location": "Quebec, QC, Canada",
            "dates": "(May 2021 - Present)",
            "degree": "Ph.D. in Computer Science",
            "courses": {
                "nlp": "IFT-4022: Natural Language Processing",
                "rl": "IFT-7201: Reinforcement Learning",
                "bigdata": "GLO-7027: Big Data",
                "cloud": "GLO-7008: Cloud Native Applications and DevOps"
            }
        },
        "masters": {
            "location": "Tunis, Tunisia",
            "dates": "(September 2017 - September 2020)",
            "degree1": "M.Sc. in Computer Science",
            "degree2": "Engineering Degree in Computer Science",
            "school": "National School of Computer Science (ENSI)",
            "courses": {
                "ai": "Artificial Intelligence",
                "ml": "Machine Learning and Deep Learning",
                "cloud": "Cloud Computing",
                "bigdata": "Big Data",
                "arch": "Software Architecture",
                "algo": "Algorithms, Data Structures and C Programming"
            }
        },
        "prep": {
            "location": "Tunis, Tunisia",
            "dates": "(September 2015 - June 2017)",
            "degree": "Mathematics and Physics",
            "school": "Preparatory Institute for Engineering Studies of Tunis (IPEIT)",
            "courses": {
                "math": "Mathematical Analysis",
                "algebra": "Algebra and Linear Algebra",
                "physics": "Physics",
                "cs": "Computer Science"
            }
        }
    },
    "projects": {
        "pageTitle": "Projects",
        "affiliation": "Affiliation:",
        "references": "References:",
        "monomorph": {
            "dates": "(November 2025)",
            "description1": "An LLM-based agentic tool that fully automates the refactoring of monolithic Java applications into microservice architectures. Built on research from",
            "description2": " MonoMorph bridges the gap between decomposition planning and executable microservices by automatically analyzing codebases, determining optimal refactoring strategies, and generating gRPC-based communication infrastructure while ensuring consistency and correctness of the newly generated microservices."
        },
        "microanalyzer": {
            "dates": "(June 2024)",
            "description": "A collection of static analysis tools in various programming languages (Java, C#, Python, JavaScript, Ruby, Go). As part of a larger research paper, this project implements a set of parsers that extract code snippets in microservices based applications for multiple programming languages."
        },
        "rldec": {
            "dates": "(May 2023)",
            "description1": "This project is an implementation of the RLDec decomposition approach as described in the paper",
            "description2": "RLDec is a decomposition tool that analyzes the source code of a monolithic Java application and suggests the recommended microservices for each class in the system using a Deep Reinforcement Learning based method. The approach was implemented mainly Using PyTorch and Ray-RLlib, a reinforcement learning library that provides a high-level API for distributed reinforcement learning."
        },
        "hydec": {
            "dates": "(December 2022)",
            "description1": "This project is an implementation of the HyDec and HierDec decomposition approaches as described in the papers:",
            "description2": "HierDec is a decomposition tool that analyzes the source code of a monolithic Java application through static analysis and a TFIDF based pipeline and suggests the recommended microservices for each class in the system using a hierarchical version of the DBSCAN algorithm.\n\nHyDec is an extension of the HierDec approach that combines the static analysis results with the dynamic analysis results to improve the quality of the decomposition.\n\nThe current implementation is a generalization of the approach proposed in HyDec enabling the use of various representations of the source code (with or instead of the static and dynamic analysis results). It includes the default configurations which correspond to the HyDec and HierDec papers."
        },
        "msextractor": {
            "dates": "(January 2022)",
            "description1": "This project is an implementation of the MSExtractor decomposition approach as described in the paper",
            "description2": "MSExtractor is a decomposition tool that analyzes the source code of a monolithic Java application and suggests the recommended microservices for each class in the system using the evolutionary algorithm IBEA (Indicator-Based Evolutionary Algorithm)."
        },
        "sunflower": {
            "title": "Automatic classification of sunflower seeds based on X-ray images",
            "dates": "(March 2020 - August 2020)",
            "description": "This project was done as part of my end of studies internship at Vilmorin Mikado. The goal was to develop a machine learning model that can classify sunflower seeds based on X-ray images. The project involved 3 main parts:",
            "parts": "<li>Developing a segmentation module to extract the seeds from the X-ray images using traditional image processing techniques</li><li>Building the classification module which included researching the best model to use, data preprocessing, and fine-tuning the Convolutional Neural Network (CNN) model on the DICOM image data</li><li>Developing a user-friendly interface to allow the users to upload the images, review them, edit them, get the classification results and fine-tune the generated results</li>"
        },
        "foodies": {
            "school": "National School of Computer Science (ENSI)",
            "dates": "(January 2019 - April 2019)",
            "description": "This project was done as part of my studies for the course \"Design and Development\" where we had to develop a software from inception to deployment. This project is recipe recommendation system for Tunisian cuisine using ingredient data. The application utilizes data mining techniques to process the ingredients and machine learning techniques to build the recommender and a Django webapp to host the system."
        }
    },
    "publications": {
        "pageTitle": "Publications",
        "peerReviewed": "Peer-Reviewed Publications",
        "preprints": "Pre-Prints"
    },
    "skills": {
        "pageTitle": "Skills",
        "languages": {
            "title": "Programming/Scripting Languages",
            "expert": "Expert Proficiency",
            "advanced": "Advanced Experience",
            "working": "Working Knowledge",
            "basic": "Basic Knowledge"
        },
        "frameworks": {
            "title": "Frameworks",
            "datascience": "Data Science & ML",
            "visualization": "Visualization",
            "web": "Web Frameworks"
        },
        "cloud": {
            "title": "Cloud and MLOps"
        },
        "tools": {
            "title": "Tools and Environments"
        },
        "databases": {
            "title": "Databases"
        }
    },
    "experience": {
        "professionalTitle": "Professional Experiences",
        "internshipsTitle": "Internships",
        "volunteeringTitle": "Volunteering Experiences",
        "readMore": "Read more",
        "techUsed": "Technologies used:",
        "ensiTitle": "National School of Computer Sciences (ENSI)",
        "lecturer": {
            "title": "Lecturer and Teaching Assistant",
            "department": "Department of Computer Science and Software Engineering",
            "courses": {
                "ift2001": "Operating Systems for Engineers",
                "glo4008": "Cloud Native Applications and DevOps",
                "glo2100": "Algorithms and Data Structures for Engineers"
            },
            "descriptionLecturer": "As a lecturer, my responsibilities involved delivering engaging and well-structured\n                                        lectures, designing and creating practical work assignments, and developing comprehensive\n                                        exams to assess student understanding. I also provided constructive feedback\n                                        and contributed to curriculum development.",
            "descriptionTA": "In my role as a teaching assistant, I led laboratory sessions, guided students\n                                        through practical work, and ensured they grasped key concepts effectively.\n                                        I also contributed by correcting exams and assignments, offering detailed feedback,\n                                        and supporting the lecturer."
        },
        "cognira": {
            "title": "Junior Data Scientist",
            "summary": "Retail time series forecasting analysis and data visualization.",
            "tasks": "<li>Weekly discussions with the client about the forecasting results and the impacted sales. </li><li>Evaluating the performance of the forecasting systems and optimizing their hyper-parameters. </li><li>Daily analysis of the recent sales and forecasting data. </li><li>Developing and improving the internal analysis tools. </li>"
        },
        "hq": {
            "title": "Data Science Research Intern",
            "summary": "Time Series Forecasting for monthly HQ specialist workloads.",
            "tasks": "<li>In this internship, I worked with a team within the Hydro-Quebec Research Institute (IREQ).\n                                        The project I worked on involved researching a time series forecasting model for the workload\n                                        done by HQ specialists across Quebec. My tasks involved:</li>\n                                    <ul>\n                                        <li>Analyzing the historical data in order to extract meaningful insights and present them to the team.</li>\n                                        <li>Refactoring and improving the architecture of the project.</li>\n                                        <li>Building a separate yearly forecasting model.</li>\n                                    </ul>"
        },
        "vilmorin": {
            "title": "Research and Development Intern",
            "summary": "Automatic classification of sunflower seeds diseases based on X-ray images.",
            "tasks": "<li>End of Study Internship: Executing the project from initial concept and planning to design, development, testing, and final deployment.</li><li>Designing a Deep Learning model that can classify the defects in sunflower seeds.</li><li>Processing and segmentation of DICOM images (X-ray) that includes batches of sunflower seed samples.</li><li>Building a GUI for improving the user experience and productivity.</li><li>Integrating the image processing and classification module into the GUI.</li>"
        },
        "teamwill": {
            "title": "Software Engineering Intern",
            "summary": "Building automated forecasting and database analysis microservices.",
            "tasks": "<li>Developing a microservice that exports and models relational databases into graph databases. </li><li>Building a prototype microservice that enables automatic forecasting or clustering. </li>"
        },
        "logidas": {
            "title": "Software Engineering Intern",
            "summary": "Developing a tool for analyzing, parsing and exporting Paradox databases.",
            "description": "Developing a tool for analyzing, parsing and exporting Paradox databases. The tool was integrated into the company's ERP product."
        },
        "eje": {
            "title": "Project Lead",
            "name": "ENSI Junior Enterprise",
            "tasks": "<li>Led the development of internal projects (such as our website) that involved the collaboration of multiple students. </li><li>Played an active role organizing events and handling partner logistics. </li>"
        },
        "gdg": {
            "title": "Executive Board member",
            "tasks": "Organizing local branches for Coding Competitions."
        },
        "yfs": {
            "title": "Instructor for middle-schoolers",
            "name": "Applied Mathematics Workshop",
            "tasks": "Teaching applied mathematics for middle-schoolers in events."
        }
    },
    "footer": {
        "quickLinks": "Quick Links"
    }
}